webservice/origin-webservice/client/helloWorld.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions name="UserServiceService" targetNamespace="http://service.pers/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.pers/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<types>
		<xsd:schema>
			<xsd:import namespace="http://service.pers/" schemaLocation="http://localhost:10001/helloWorld?xsd=1"/>
		</xsd:schema>
	</types>
	<message name="queryUser">
		<part element="tns:queryUser" name="parameters"/>
	</message>
	<message name="queryUserResponse">
		<part element="tns:queryUserResponse" name="parameters"/>
	</message>
	<portType name="UserService">
		<operation name="queryUser">
			<input message="tns:queryUser" wsam:Action="http://service.pers/UserService/queryUserRequest"/>
			<output message="tns:queryUserResponse" wsam:Action="http://service.pers/UserService/queryUserResponse"/>
		</operation>
	</portType>
	<binding name="UserServicePortBinding" type="tns:UserService">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="queryUser">
			<soap:operation soapAction=""/>
			<input>
				<soap:body use="literal"/>
			</input>
			<output>
				<soap:body use="literal"/>
			</output>
		</operation>
	</binding>
	<service name="UserServiceService">
		<port binding="tns:UserServicePortBinding" name="UserServicePort">
			<soap:address location="http://localhost:10001/helloWorld"/>
		</port>
	</service>
</definitions>